Revit 2027 API
LinkNode Class
 An output node that represents a linked Revit document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.GroupNode
 Autodesk.Revit.DB.LinkNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LinkNode : GroupNode
Public Class LinkNode
	Inherits GroupNode
public ref class LinkNode : public GroupNode
type LinkNode =
    class
        inherit GroupNode
    end
The LinkNode type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RenderNode)
NodeName |  A readable name of the output node.
(Inherited from RenderNode)
SymbolId |  Identifies the Id of the symbol associated with the node.
Top
Methods
Name | Description
Dispose
(Inherited from RenderNode)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetDocument |  Returns the document associated with the link.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetTransform |  A transformation matrix associated with the node.
(Inherited from GroupNode)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 See also: OnLinkBegin(LinkNode).
See Also
Reference
Autodesk.Revit.DB Namespace